<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"1c57bf5f6d78a11f431f484b22d535ea81e50202fbce513fc4999f58ebdab4d2","plan_job_ref":"Job Test plan target and replace #400 at https://github.com/dflook/terraform-github-actions/actions/runs/7447862722","plan_out_hash":"5cd97314bdb2b2a938a9c832d2a245bb0ca2639522b1abcba2fc7aceff2ff8e8","plan_hash":"75850a7878247dadc83322207b19560984466c3acbfe563c243af5ba42ce6098","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "C9bsEcwuOx" -> (known after apply)
!~  foreach = "v6kBAJvBPf" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #400](https://github.com/dflook/terraform-github-actions/actions/runs/7447862722)